Implement UI for system
